tap "fwartner/mac-cleanup"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "isacikgoz/taps"
tap "vitorgalvao/tiny-scripts"

brew "antigen"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "duti"
brew "jq"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fileicon"
brew "node"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "grc"
brew "grep"
brew "imagemagick"
brew "isacikgoz/taps/tldr"
brew "libtool"
brew "mackup"
brew "mas"
brew "mkcert"
brew "neofetch"
brew "nvm"
brew "prettyping"
brew "python"
brew "rename"
brew "ruby"
brew "starship"
brew "terminal-notifier"
brew "tree"
brew "vitorgalvao/tiny-scripts/calm-notifications"
brew "webp"
brew "wget"
brew "yank"
brew "yarn"
brew "youtube-dl"
brew "zoxide"

cask "1password"
cask "airpass"
cask "alfred"
cask "amethyst"
cask "beardedspice"
cask "brave-browser"
cask "figma"
cask "firefox"
cask "google-backup-and-sync"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "kaleidoscope"
cask "latest"
cask "rightfont"
cask "signal"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"

mas "Xcode", id: 497799835
mas "EasyRes", id: 688211836 
mas "Amphetamine", id: 937984704 
