tap "fwartner/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "isacikgoz/taps"
tap "jesseduffield/lazygit"
tap "shopify/shopify"
tap "vitorgalvao/tiny-scripts"
brew "antigen"
brew "python@3.9"
brew "glib"
brew "cargo-c"
brew "coreutils"
brew "curl"
brew "dockutil"
brew "duti"
brew "exa"
brew "fd"
brew "fileicon"
brew "node"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-standup"
brew "grc"
brew "grep"
brew "libtool"
brew "luajit", args: ["HEAD"]
brew "mackup"
brew "mas"
brew "mkcert"
brew "neofetch"
brew "neovim"
brew "nvm"
brew "prettyping"
brew "rename"
brew "ripgrep"
brew "rust"
brew "starship"
brew "stylua"
brew "terminal-notifier"
brew "tree"
brew "unbound", link: false
brew "webp"
brew "wget"
brew "yank"
brew "youtube-dl"
brew "zoxide"
brew "fwartner/tap/mac-cleanup"
brew "isacikgoz/taps/tldr"
brew "jesseduffield/lazygit/lazygit"
brew "shopify/shopify/shopify-cli"
brew "vitorgalvao/tiny-scripts/calm-notifications"
cask "1password"
cask "airpass"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "beardedspice"
cask "brave-browser"
cask "chromium"
cask "diffmerge"
cask "dozer"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-backup-and-sync"
cask "graphql-playground"
cask "handbrake"
cask "imageoptim"
cask "iterm2"
cask "kaleidoscope"
cask "kap"
cask "latest"
cask "raycast"
cask "rightfont"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "teamviewer"
cask "transmission"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "Xcode", id: 497799835
